-- 初始化站点主数据

INSERT INTO stations (
    station_name,
    region,
    address,
    longitude,
    latitude,
    station_manager_name,
    station_manager_phone,
    station_type,
    asset_type,
    status
)
VALUES
('宝杨第一加油站', '宝静片区', '宝山区宝杨路3076号', 121.486190, 31.401158, '柳洪慧', '15802113010', '加油站', '全资', '营业中'),
('宝杨第二加油站', '宝静片区', '宝山区宝杨路2058号', 121.487900, 31.392000, '林陈', '13817386470', '加油站', '全资', '营业中'),
('泰和加油站', '宝静片区', '宝山区泰和路1188号', 121.460800, 31.346500, '孙翠翠', '13788946922', '加油站', '控股', '营业中'),
('维辉加油站', '宝静片区', '宝山区沪太路8365号', 121.338800, 31.441800, '徐燕', '13918907571', '加油站', '全资', '营业中'),
('锦秋加油站', '宝静片区', '宝山区沪太路3288号', 121.407200, 31.319800, '张莉', '13817240707', '加油站', '控股', '营业中'),

('常德路加油站', '宝静片区', '静安区常德路557号', 121.449570, 31.236288, '张猛', '13817024103', '加油站', '控股', '营业中'),
('灵广加油站', '宝静片区', '静安区灵石路702号', 121.443800, 31.281600, '严慧裕', '13816646371', '加油站', '参股', '营业中'),
('闸北第一加油站', '宝静片区', '静安区沪太路857号', 121.446500, 31.269600, '严慧裕', '13816646371', '加油站', '全资', '营业中'),

('唐山路加油站', '宝静片区', '虹口区唐山路481号', 121.503900, 31.257800, '崔文星', '13564882675', '加油站', '控股', '营业中'),
('晟隆加油站', '宝静片区', '虹口区奎照路515号', 121.479500, 31.303200, '吴颖', '13524808046', '加油站', '参股', '营业中'),

('普陀第一加油站', '闵普徐片区', '普陀区真光路1877号', 121.395080, 31.256640, '林祖贤', '13661903227', '加油站', '全资', '营业中'),
('金迈加油站', '闵普徐片区', '普陀区金迈路28号', 121.392600, 31.252300, '伍辉', '13661495223', '加油站', '控股', '营业中'),
('泾阳加油站', '闵普徐片区', '普陀区金沙江路2405号', 121.383700, 31.237700, '吴沈康', '13764297207', '加油站', '参股', '营业中'),

('上中油气站', '闵普徐片区', '徐汇区龙州路588号', 121.457000, 31.151300, '洪赫', '13636687747', '加油站', '参股', '营业中'),
('华浦加油站', '闵普徐片区', '徐汇区龙吴路2453号', 121.454500, 31.124000, '杨韵池', '13681960724', '加油站', '控股', '营业中'),
('龙吴路加油站', '闵普徐片区', '徐汇区龙吴路560号', 121.452700, 31.135900, '洪杰', '18964026820', '加油站', '全资', '营业中'),
('凯燕加油站', '闵普徐片区', '徐汇区凯旋路2048号', 121.430947, 31.194621, '潘虹', '13817541091', '加油站', '控股', '营业中'),

('华辉加油站', '闵普徐片区', '长宁区仙霞路1310号', 121.399729, 31.211499, '曹红', '13917097260', '加油站', '控股', '营业中'),

('崇明第二加油店', '崇明片区', '崇明区建设镇建设公路2230号', 121.606800, 31.546300, '沙海燕', '18516294972', '加油站', '全资', '营业中'),
('崇明第三加油店', '崇明片区', '崇明区陈彷公路3099弄20号', 121.840200, 31.563600, '施张伟', '13817535779', '加油站', '全资', '营业中'),
('崇明第四加油店', '崇明片区', '崇明区北沿公路399号', 121.545900, 31.674800, '顾雷娟', '19946295433', '加油站', '全资', '营业中'),
('崇明第五加油店', '崇明片区', '崇明区三星镇宏海公路4701号', 121.511300, 31.612200, '顾娣', '13916599983', '加油站', '全资', '营业中'),
('崇明第七加油店', '崇明片区', '崇明区竖新镇前竖公路2825号', 121.750100, 31.590700, '沈菊花', '13641870778', '加油站', '全资', '营业中'),
('崇明第八加油店', '崇明片区', '崇明区新河镇北新公路342号', 121.640900, 31.644700, '陈利琴', '13585829472', '加油站', '全资', '营业中'),
('崇明第九加油店', '崇明片区', '崇明区港沿镇港沿公路985号', 121.731100, 31.559900, '陈利琴', '13585829472', '加油站', '全资', '营业中'),
('崇明第十三加油店', '崇明片区', '崇明区竖新镇团城公路1821号', 121.789800, 31.582200, '陆建国', '13681691062', '加油站', '全资', '营业中'),
('崇明第十四加油店', '崇明片区', '崇明区陈彷公路5001号', 121.864700, 31.561900, '施张伟', '13817535779', '加油站', '全资', '营业中'),
('崇明第十五加油店', '崇明片区', '崇明区陈家镇陈彷公路258号', 121.927800, 31.504400, '张霞', '13816553720', '加油站', '全资', '营业中'),
('崇明第十八加油店', '崇明片区', '崇明区港西镇三双公路1231号', 121.384500, 31.678100, '沈皓华', '13916542270', '加油站', '全资', '营业中'),
('崇明第二十加油站', '崇明片区', '崇明区北沿公路3398号', 121.451600, 31.666200, '顾娣', '13916599983', '加油站', '全资', '营业中'),
('南门路加油站', '崇明片区', '崇明区南门路487号', 121.403400, 31.624000, '丁雪峰', '13501979810', '加油站', '全资', '营业中'),
('前卫加油站', '崇明片区', '崇明区长兴镇丰福路899号', 121.743800, 31.399900, '龚亮', '13601781731', '加油站', '控股', '营业中'),
('圆沙加油站', '崇明片区', '崇明区长兴岛仁建路2号', 121.751500, 31.414300, '汤春华', '13764319515', '加油站', '控股', '营业中'),
('振中加油站（15#）', '崇明片区', '崇明区陈海公路1500号', 121.496800, 31.616400, '赵春涛', '17601359942', '加油站', '控股', '停业中'),
('陈海加油站（5#）', '崇明片区', '崇明区陈海公路2151号', 121.533900, 31.608300, '裴文静', '18116363236', '加油站', '控股', '停业中');
