-- 初始化站点主数据

INSERT INTO stations (
    station_name,
    region,
    address,
    longitude,
    latitude,
    station_manager_name,
    station_manager_phone,
    station_type,
    asset_type,
    status,
    operating_hours
)
VALUES
('沈浦泾南加油站', '松金片区', '金山区沈浦泾南路66号', 121.174976, 30.886129, '张三', '021-67220331', '加油站', '全资', '营业中', '06:00-22:00'),
('乐都加油站', '松金片区', '松江区乐都路143号', 121.237673, 31.013365, '张三', '021-57823449', '加油站', '全资', '营业中', '24小时'),
('爱使浦南加油站', '浦东片区', '浦东新区浦东南路1864号', 121.518320, 31.215971, '张三', '021-50810202', '加油站', '全资', '营业中', '24小时'),
('东新加油站', '南汇片区', '浦东新区书院镇老芦公路668号', 121.867093, 30.986920, '张三', '021-58196876', '加油站', '全资', '营业中', '06:00-20:00'),
('嘉松加油站', '嘉青片区', '嘉定区嘉松北路7501号', 121.206640, 31.267951, '张三', '021-39531783', '加油站', '全资', '营业中', '24小时'),
('同盛第一加油站', '中油同盛', '浦东新区云夏路329号', 121.803269, 30.906409, '张三', '021-00000000', '加油站', '全资', '营业中', '24小时'),
('共富加油站', '中油农工商', '崇明区堡镇北路737号', 121.637533, 31.562744, '张三', '021-39660666', '加油站', '股权并表', '营业中', '07:00-19:30'),
('金山农工商加油站', '中油奉贤', '金山区山阳镇卫零北路615号', 121.330655, 30.747115, '张三', '021-33698379', '加油站', '股权并表', '营业中', '24小时'),
('安达加油站', '奉贤片区', '奉贤区南奉公路1501号', 121.608974, 30.918870, '张三', '021-60890779', '加油站', '全资', '营业中', '06:00-20:30'),
('A30加油站', '奉贤片区', '奉贤区光明镇清璇路142弄33号', 121.519743, 30.909311, '张三', '021-60890773', '加油站', '全资', '营业中', '24小时'),

('虹梅南路加油站', '闵普徐片区', '闵行区虹梅南路2980号', 121.436137, 31.092135, '张三', '021-64978849', '加油站', '全资', '营业中', '24小时'),
('虹莘梅莘加油站', '闵普徐片区', '闵行区莘朱路1058号', 121.413089, 31.118406, '张三', '021-54377032', '加油站', '全资', '营业中', '24小时'),
('华辉加油站', '闵普徐片区', '长宁区仙霞路1310号', 121.374841, 31.207560, '曹红', '021-62910653', '加油站', '全资', '营业中', '24小时'),
('华浦加油站', '闵普徐片区', '徐汇区龙吴路2453号', 121.456047, 31.115924, '杨韵池', '021-54821750', '加油站', '全资', '营业中', '24小时'),
('金迈加油站', '闵普徐片区', '普陀区金迈路28号', 121.334616, 31.288820, '伍辉', '021-36522958', '加油站', '全资', '营业中', '07:00-19:00'),
('泾阳加油站', '闵普徐片区', '普陀区长征镇金沙江路2405号', 121.364028, 31.239101, '吴沈康', '021-62598960', '加油站', '全资', '营业中', '07:00-00:00'),
('凯燕加油站', '闵普徐片区', '徐汇区凯旋路2048号', 121.423910, 31.192011, '潘虹', '021-64474206', '加油站', '全资', '营业中', '06:30-23:00'),
('龙吴路加油站', '闵普徐片区', '徐汇区龙吴路560号', 121.450468, 31.155598, '洪杰', '021-54363919', '加油站', '全资', '营业中', '07:00-21:00'),
('闵行第一加油站', '闵普徐片区', '闵行区放鹤路999号', 121.450428, 31.046869, '张三', '021-64520611', '加油站', '全资', '营业中', '24小时'),
('普陀第一加油站', '闵普徐片区', '普陀区真光路1877号', 121.385753, 31.254258, '林祖贤', '021-52781628', '加油站', '全资', '营业中', '07:00-21:00'),
('上中加油站', '闵普徐片区', '徐汇区龙州路588号', 121.424836, 31.135339, '洪赫', '021-64764767', '加油站', '全资', '营业中', '24小时'),
('莘庄工业区加油站', '闵普徐片区', '闵行区中春路1988号', 121.388329, 31.062616, '张三', '021-64420126', '加油站', '全资', '营业中', '24小时'),
('中春加油站', '闵普徐片区', '闵行区中春路7331号', 121.344238, 31.141803, '张三', '021-64195637', '加油站', '全资', '营业中', '24小时'),

('崇明第八加油站', '崇明片区', '崇明区新河镇北新公路342号', 121.537296, 31.614245, '陈利琴', '021-59372861', '加油站', '全资', '营业中', '06:00-18:00'),
('崇明第二加油站', '崇明片区', '崇明区建设镇建设公路2230号', 121.455794, 31.664427, '沙海燕', '021-59330919', '加油站', '全资', '营业中', '06:00-18:00'),
('崇明第二十加油站', '崇明片区', '崇明区北沿公路3398号', 121.288963, 31.817166, '顾娣', '021-59655354', '加油站', '全资', '营业中', '06:00-18:00'),
('崇明第九加油站', '崇明片区', '崇明区港沿镇港沿公路985号', 121.649150, 31.578124, '陈利琴', '021-59461159', '加油站', '全资', '营业中', '06:00-18:00'),
('崇明第七加油站', '崇明片区', '崇明区竖新镇前竖公路2825号', 121.601397, 31.610863, '沈菊花', '021-59490533', '加油站', '全资', '营业中', '06:00-18:00'),
('崇明第三加油站', '崇明片区', '崇明区陈彷公路3099弄20号', 121.752388, 31.519247, '施张伟', '021-69445815', '加油站', '全资', '营业中', '06:00-18:00'),
('崇明第十八加油站', '崇明片区', '崇明区港西镇三双公路1231号', 121.416037, 31.681181, '沈皓华', '021-59670140', '加油站', '全资', '营业中', '06:00-18:00'),
('崇明第十三加油站', '崇明片区', '崇明区竖新镇团城公路1821号', 121.584141, 31.562568, '陆建国', '021-59481001', '加油站', '全资', '营业中', '06:30-17:30'),
('崇明第十四加油站', '崇明片区', '崇明区陈彷公路5001号', 121.714924, 31.527441, '施张伟', '021-59444640', '加油站', '全资', '营业中', '06:00-18:00'),
('崇明第十五加油站', '崇明片区', '崇明区陈家镇陈彷公路258号', 121.800787, 31.501418, '张霞', '021-59430106', '加油站', '全资', '营业中', '06:30-20:30'),
('崇明第四加油站', '崇明片区', '崇明区北沿公路399号', 121.838480, 31.539840, '顾雷娟', '021-59618016', '加油站', '全资', '营业中', '06:30-20:30'),
('崇明第五加油站', '崇明片区', '崇明区三星镇宏海公路4701号', 121.283971, 31.747114, '顾娣', '021-59601662', '加油站', '全资', '营业中', '06:00-18:00'),
('丰福路加油站', '崇明片区', '崇明区长兴岛丰福路899号', 121.706877, 31.393771, '龚亮', '021-56859660', '加油站', '全资', '营业中', '24小时'),
('南门路加油站', '崇明片区', '崇明区南门路487号', 121.386657, 31.620953, '丁雪峰', '021-59623722', '加油站', '全资', '营业中', '24小时'),
('仁建路加油站', '崇明片区', '崇明区长兴镇仁建路2号', 121.766185, 31.347570, '汤春华', '021-66856137', '加油站', '全资', '营业中', '06:30-19:30'),

('爱使东方唐山路加油站', '宝静片区', '虹口区唐山路481号', 121.504959, 31.255183, '崔文星', '021-65358444', '加油站', '全资', '营业中', '07:00-23:00'),
('宝杨第二加油站', '宝静片区', '宝山区宝杨路2058号', 121.460278, 31.385232, '林陈', '021-33790749', '加油站', '全资', '营业中', '06:30-21:00'),
('宝杨第一加油站', '宝静片区', '宝山区宝杨路3076号', 121.443887, 31.375986, '柳洪慧', '021-56491127', '加油站', '全资', '营业中', '24小时'),
('常德路加油站', '宝静片区', '静安区常德路557号', 121.445562, 31.230296, '张猛', '021-62584654', '加油站', '全资', '营业中', '24小时'),
('晟隆加油站', '宝静片区', '虹口区奎照路515号', 121.475655, 31.300178, '吴颖', '021-65282328', '加油站', '全资', '营业中', '24小时'),
('锦秋加油站', '宝静片区', '宝山区沪太路3288号', 121.447685, 31.319283, '张莉', '021-56335763', '加油站', '全资', '营业中', '24小时'),
('灵广加油站', '宝静片区', '静安区灵石路702号', 121.440832, 31.282573, '严慧裕', '021-56658807', '加油站', '全资', '营业中', '24小时'),
('凌桥第二加油站', '宝静片区', '浦东新区江东路861弄1号', 121.537659, 31.373002, '张三', '021-58647480', '加油站', '全资', '营业中', '24小时'),
('凌桥第一加油站', '宝静片区', '浦东新区江东路861弄2号', 121.536115, 31.372457, '张三', '021-58647205', '加油站', '全资', '营业中', '24小时'),
('泰和加油站', '宝静片区', '宝山区泰和路1188号', 121.466399, 31.364736, '孙翠翠', '021-56840473', '加油站', '全资', '营业中', '24小时'),
('维辉加油站', '宝静片区', '宝山区沪太公路8365号', 121.331399, 31.448080, '徐燕', '021-66865580', '加油站', '全资', '营业中', '24小时'),
('物流园区加油站', '宝静片区', '浦东新区物流园区申海路88号', 121.570430, 31.372073, '张三', '021-38750182', '加油站', '全资', '营业中', '07:00-21:00'),
('闸北第一加油站', '宝静片区', '静安区沪太路857号', 121.438880, 31.269186, '严慧裕', '021-56958746', '加油站', '全资', '营业中', '24小时'),

('中国石油三林园快充站', '沪东', '浦东新区懿德路519号', 121.523028, 31.120334, '张三', '021-00000000', '充电站', '全资新建', '营业中', '24小时'),
('富特北路充电站', '沪东', '浦东新区富特北路17号3楼', 121.591650, 31.349949, '张三', '021-00000000', '充电站', '全资收购', '营业中', '24小时'),
('【融和霆】蔡伦路站', '沪东', '浦东新区蔡伦路95号', 121.620895, 31.196496, '张三', '021-00000000', '充电站', '全资收购', '营业中', '24小时'),
('【煜砺】宝山杨行站', '沪东', '宝山区宝安公路319号', 121.419638, 31.367950, '张三', '021-00000000', '充电站', '全资收购', '营业中', '24小时'),

('吴中路充电站', '沪南', '闵行区吴中路699号全季酒店地面停车场', 121.396195, 31.180696, '张三', '021-00000000', '充电站', '全资新建', '营业中', '24小时'),
('双柏路充电站', '沪南', '闵行区景东路4889号', 121.451981, 31.091157, '张三', '021-00000000', '充电站', '全资新建', '营业中', '24小时'),
('金山中一东路充电站', '沪南', '金山区漕泾镇中一东路195号临', 121.421309, 30.793782, '张三', '021-00000000', '充电站', '全资新建', '营业中', '24小时'),
('【融和霆】龙吴路充电站', '沪南', '闵行区龙吴路5142号', 121.465541, 31.052804, '张三', '021-00000000', '充电站', '全资收购', '营业中', '24小时'),

('嘉松充电站', '沪西', '嘉定区嘉松北路7501号', 121.205076, 31.267772, '张三', '021-00000000', '充电站', '全资新建', '营业中', '24小时'),
('嘉定公交（胜竹路）充电站', '沪西', '嘉定区胜竹路1750号', 121.258023, 31.403602, '张三', '021-00000000', '充电站', '全资新建', '营业中', '24小时'),
('永新路充电站', '沪西', '嘉定区永新路1198号', 121.261366, 31.416038, '张三', '021-00000000', '充电站', '全资租赁', '营业中', '24小时'),
('嘉立国际快充站', '沪西', '松江区广富林路697号', 121.244210, 31.056310, '张三', '021-00000000', '充电站', '全资收购', '营业中', '24小时'),

('前曹路充电站', '沪北', '嘉定区前曹路88号', 121.303608, 31.473602, '张三', '021-00000000', '充电站', '全资租赁', '营业中', '24小时'),
('飘鹰充电站', '沪北', '虹口区新港路223号', 121.498988, 31.269609, '张三', '021-00000000', '充电站', '全资新建', '营业中', '24小时'),
('月罗路充电站', '沪北', '宝山区月罗路241号', 121.372112, 31.416972, '张三', '021-00000000', '充电站', '全资新建', '营业中', '24小时'),
('锦和尚城充电站', '沪北', '徐汇区田林路140号', 121.414013, 31.169871, '张三', '021-00000000', '充电站', '全资租赁', '营业中', '24小时'),

('陆家嘴滨江中心充电站', '中油农工商', '浦东新区滨江大道，浦明路微山路交叉口', 121.512558, 31.208082, '张三', '021-00000000', '充电站', '控股新建', '营业中', '24小时'),

('观海路充电站', '中油同盛', '浦东新区观海路100号', 121.781334, 31.024822, '张三', '021-00000000', '充电站', '参股新建', '营业中', '24小时'),
('伊犁路充电站', '中油同盛', '长宁区伊犁路97号', 121.404661, 31.200196, '张三', '021-00000000', '充电站', '全资新建', '营业中', '24小时'),

('古棕路充电站', '中油港汇', '浦东新区古棕路800弄1-2号', 121.911922, 30.878602, '张三', '021-00000000', '充电站', '控股新建', '营业中', '24小时'),
('新材料研究院充电站', '中油港汇', '浦东新区临隽路116号', 121.932114, 30.874794, '张三', '021-00000000', '充电站', '其他', '营业中', '24小时'),

('平霄路充电站', '中油申能', '浦东新区平霄路820号', 121.755981, 30.886808, '张三', '021-00000000', '充电站', '参股新建', '营业中', '24小时'),

('思贤路充电站', '中油上海', '松江区思贤路3788号', 121.156062, 31.022861, '张三', '021-00000000', '充电站', '控股新建', '营业中', '24小时'),

('上海奉贤区马家宅路充电站', '中油奉贤', '奉贤区马家宅路95号', 121.439077, 30.968526, '张三', '021-00000000', '充电站', '全资收购', '营业中', '24小时'),

('【蝶尔】陈春路佩玛福悦广场快充站', '中油康桥', '浦东新区北蔡镇佩玛福悦艺术生活中心', 121.583321, 31.191003, '张三', '021-00000000', '充电站', '全资收购', '营业中', '24小时'),

('中国石油安亭文体中心充电站', '普天上海', '嘉定区墨玉路621号停车场', 121.163649, 31.305885, '张三', '021-00000000', '充电站', '自建', '营业中', '24小时'),
('中国石油青浦崧泽大道充电站', '普天上海', '青浦区崧泽大道6658号', 121.176234, 31.177495, '张三', '021-00000000', '充电站', '自建', '营业中', '24小时'),
('中国石油宝山军工路充电站', '普天上海', '宝山区军工路5369号', 121.497499, 31.351598, '张三', '021-00000000', '充电站', '自建', '营业中', '24小时'),
('中国石油重固公交站充电站', '普天上海', '青浦区福贸路55、56号', 121.194770, 31.194964, '张三', '021-00000000', '充电站', '自建', '营业中', '24小时'),
('中石油奉贤美谷美购充电站', '普天上海', '奉贤区南桥新城美谷美购广场', 121.484159, 30.929680, '张三', '021-00000000', '充电站', '自建', '营业中', '24小时');