-- 初始化站点主数据

INSERT INTO stations (
    station_name,
    region,
    address,
    longitude,
    latitude,
    station_manager_name,
    station_manager_phone,
    station_type,
    asset_type,
    status,
    operating_hours
)
VALUES
('宝杨第一加油站', '宝静片区', '宝山区宝杨路3076号', 121.486190, 31.401158, '张三', '021-00000000', '加油站', '全资', '营业中', '24小时'),
('宝杨第二加油站', '宝静片区', '宝山区宝杨路2058号', 121.487900, 31.392000, '张三', '021-00000000', '加油站', '全资', '营业中', '24小时'),
('泰和加油站', '宝静片区', '宝山区泰和路1188号', 121.460800, 31.346500, '张三', '021-00000000', '加油站', '控股', '营业中', '24小时'),
('维辉加油站', '宝静片区', '宝山区沪太路8365号', 121.338800, 31.441800, '张三', '021-00000000', '加油站', '全资', '营业中', '24小时'),
('锦秋加油站', '宝静片区', '宝山区沪太路3288号', 121.407200, 31.319800, '张三', '021-00000000', '加油站', '控股', '营业中', '24小时'),

('常德路加油站', '宝静片区', '静安区常德路557号', 121.449570, 31.236288, '张三', '021-00000000', '加油站', '控股', '营业中', '24小时'),
('灵广加油站', '宝静片区', '静安区灵石路702号', 121.443800, 31.281600, '张三', '021-00000000', '加油站', '参股', '营业中', '24小时'),
('闸北第一加油站', '宝静片区', '静安区沪太路857号', 121.446500, 31.269600, '张三', '021-00000000', '加油站', '全资', '营业中', '24小时'),

('唐山路加油站', '宝静片区', '虹口区唐山路481号', 121.503900, 31.257800, '张三', '021-00000000', '加油站', '控股', '营业中', '24小时'),
('晟隆加油站', '宝静片区', '虹口区奎照路515号', 121.479500, 31.303200, '张三', '021-00000000', '加油站', '参股', '营业中', '24小时'),

('普陀第一加油站', '闵普徐片区', '普陀区真光路1877号', 121.395080, 31.256640, '张三', '021-00000000', '加油站', '全资', '营业中', '24小时'),
('金迈加油站', '闵普徐片区', '普陀区金迈路28号', 121.392600, 31.252300, '张三', '021-00000000', '加油站', '控股', '营业中', '24小时'),
('泾阳加油站', '闵普徐片区', '普陀区金沙江路2405号', 121.383700, 31.237700, '张三', '021-00000000', '加油站', '参股', '营业中', '24小时'),

('上中油气站', '闵普徐片区', '徐汇区龙州路588号', 121.457000, 31.151300, '张三', '021-00000000', '加油站', '参股', '营业中', '24小时'),
('华浦加油站', '闵普徐片区', '徐汇区龙吴路2453号', 121.454500, 31.124000, '张三', '021-00000000', '加油站', '控股', '营业中', '24小时'),
('龙吴路加油站', '闵普徐片区', '徐汇区龙吴路560号', 121.452700, 31.135900, '张三', '021-00000000', '加油站', '全资', '营业中', '24小时'),
('凯燕加油站', '闵普徐片区', '徐汇区凯旋路2048号', 121.430947, 31.194621, '张三', '021-00000000', '加油站', '控股', '营业中', '24小时'),

('华辉加油站', '闵普徐片区', '长宁区仙霞路1310号', 121.399729, 31.211499, '张三', '021-00000000', '加油站', '控股', '营业中', '24小时'),

('崇明第二加油店', '崇明片区', '崇明区建设镇建设公路2230号', 121.606800, 31.546300, '张三', '021-00000000', '加油站', '全资', '营业中', '24小时'),
('崇明第三加油店', '崇明片区', '崇明区陈彷公路3099弄20号', 121.840200, 31.563600, '张三', '021-00000000', '加油站', '全资', '营业中', '24小时'),
('崇明第四加油店', '崇明片区', '崇明区北沿公路399号', 121.545900, 31.674800, '张三', '021-00000000', '加油站', '全资', '营业中', '24小时'),
('崇明第五加油店', '崇明片区', '崇明区三星镇宏海公路4701号', 121.511300, 31.612200, '张三', '021-00000000', '加油站', '全资', '营业中', '24小时'),
('崇明第七加油店', '崇明片区', '崇明区竖新镇前竖公路2825号', 121.750100, 31.590700, '张三', '021-00000000', '加油站', '全资', '营业中', '24小时'),
('崇明第八加油店', '崇明片区', '崇明区新河镇北新公路342号', 121.640900, 31.644700, '张三', '021-00000000', '加油站', '全资', '营业中', '24小时'),
('崇明第九加油店', '崇明片区', '崇明区港沿镇港沿公路985号', 121.731100, 31.559900, '张三', '021-00000000', '加油站', '全资', '营业中', '24小时'),
('崇明第十三加油店', '崇明片区', '崇明区竖新镇团城公路1821号', 121.789800, 31.582200, '张三', '021-00000000', '加油站', '全资', '营业中', '24小时'),
('崇明第十四加油店', '崇明片区', '崇明区陈彷公路5001号', 121.864700, 31.561900, '张三', '021-00000000', '加油站', '全资', '营业中', '24小时'),
('崇明第十五加油店', '崇明片区', '崇明区陈家镇陈彷公路258号', 121.927800, 31.504400, '张三', '021-00000000', '加油站', '全资', '营业中', '24小时'),
('崇明第十八加油店', '崇明片区', '崇明区港西镇三双公路1231号', 121.384500, 31.678100, '张三', '021-00000000', '加油站', '全资', '营业中', '24小时'),
('崇明第二十加油站', '崇明片区', '崇明区北沿公路3398号', 121.451600, 31.666200, '张三', '021-00000000', '加油站', '全资', '营业中', '24小时'),
('南门路加油站', '崇明片区', '崇明区南门路487号', 121.403400, 31.624000, '张三', '021-00000000', '加油站', '全资', '营业中', '24小时'),
('前卫加油站', '崇明片区', '崇明区长兴镇丰福路899号', 121.743800, 31.399900, '张三', '021-00000000', '加油站', '控股', '营业中', '24小时'),
('圆沙加油站', '崇明片区', '崇明区长兴岛仁建路2号', 121.751500, 31.414300, '张三', '021-00000000', '加油站', '控股', '营业中', '24小时'),
('振中加油站', '崇明片区', '崇明区陈海公路1500号', 121.496800, 31.616400, '张三', '021-00000000', '加油站', '控股', '停业中', '24小时'),
('陈海加油站', '崇明片区', '崇明区陈海公路2151号', 121.533900, 31.608300, '张三', '021-00000000', '加油站', '控股', '停业中', '24小时'),
('沈浦泾南','松金','',NULL,NULL,'张三','021-00000000','加油站','全资','营业中','24小时'),
('公交东站撬装站','松金','',NULL,NULL,'张三','021-00000000','加油站','全资','营业中','24小时'),
('金朝','松金','',NULL,NULL,'张三','021-00000000','加油站','全资','营业中','24小时'),
('金发','松金','',NULL,NULL,'张三','021-00000000','加油站','全资','营业中','24小时');
