

-- 初始化巡检规范标准数据

INSERT INTO inspection_standards (
    code,
    business_process,
    check_item,
    check_content,
    requirement,
    check_method
)
VALUES
(
    '1',
    '质量监控',
    '储油周期',
    '油品检验',
    'a.销售公司《成品油质量管理办法》；\nb.销售公司《加油站管理规范—操作手册》（2021版）',
    'a.查看加油站油品购进记录，核对是否存在超期储存油品，是否对超期储存油品进行重新抽样检验，并留存相关抽样检验证据。'
),
(
    '2',
    '质量监控',
    '油品水杂',
    '水杂检测',
    'a.销售公司《加油站管理规范—操作手册》（2021版）。',
    'a.查看加油站水高检测记录，是否按要求定期开展水高检测；\nb.加油站现场对储罐内油品进行水杂检测，查看是否存在水杂；\nc.查看油品接卸视频监控，核实含水地罐在油品接卸期间是否存在边卸油边加油情况。'
),
(
    '6',
    '计量监控',
    '回罐油监控',
    '回罐油审批',
    'a.销售公司《加油站管理规范》（2021版）；\nb.销售公司《加油站计量稽查管理规定》。',
    'a.通过站级系统查看回罐油审批记录，回罐油申请原因、回罐时间、数量是否真实；\nb.根据回罐油记录的时间，视频回放检查回罐油加出及回罐过程是否由经理、前庭主管对出枪油品进行回罐操作；\nc.检查加油站日志是否登记回罐油操作人员等信息。'
),
(
    '10',
    '计量监控',
    '油品库存管理',
    '库存盘点',
    'a.销售公司《加油站管理规范》（2021版）；\nb.销售公司《加油站计量稽查管理规定》。',
    'a.检查盘点表，对异常盈亏是否进行原因分析，核实实存数据是否与油品计量账内数据一致；\nb.通过站级系统查看库存油品计量帐报表，查看是否有异常损耗，出现异常损耗是否进行原因分析。'
),
(
    '20',
    '人员管理',
    '计量人员',
    '计量员培训',
    'a.《中国石油天然气集团有限公司计量员管理规定》。',
    'a.查看专（兼）职计量人员培训记录，是否对计量人员开展计量相关知识培训；\nb.检查相关学习记录，是否对系统内外已发生的油品质量计量案例下发学习；\nc.通过访谈或现场实操检验计量人员相关计量知识掌握情况。'
);